## CHAPTER 3
---
# DATA WRANGLING

---
### 1.1 Loading the Data

Import the Pandas library

In [1]:
import pandas as pd

Load the csv file "titanic" in the "data" folder and assign it to "titanic" (dataframe)

In [2]:
titanic = pd.read_csv("data/titanic.csv")

Show the first 4 rows of "titanic"

In [3]:
titanic.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

Show the last 4 rows of "titanic"

In [4]:
titanic.tail(4)

                        Name PClass   Age   Sex  Survived  SexCode
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0        0
1310        Zenni, Mr Philip    3rd  22.0  male         0        0
1311        Lievens, Mr Rene    3rd  24.0  male         0        0
1312          Zimmerman, Leo    3rd  29.0  male         0        0

### 1.2 Creating a DataFrame

Create a new dataframe and name it "df_scratch". Show "df_scratch"

In [5]:
df_scratch = pd.DataFrame()
df_scratch

Empty DataFrame
Columns: []
Index: []

To "df_scratch":
- Add column 'Name' containing 'Elizabeth Walton', 'Helen Loraine', 'Hudson Creighton', and 'Hudson JC'
- Add column 'Age' containing 29, 2, 30, and 25
- Add column 'Female' containing True, True, False, and True
- Add column 'Survived' containing 1, 0, 0, and 0
- Show "df_scratch"

In [6]:
df_scratch["Name"] = ["Elizabeth Walton", "Helen Loraine", 
                     "Hudson Creighton", "Hudson JC"]
df_scratch["Age"] = [29, 2, 30, 25]
df_scratch["Female"] = [True, True, False, True]
df_scratch["Survived"] = [1, 0, 0, 0]
df_scratch

               Name  Age  Female  Survived
0  Elizabeth Walton   29    True         1
1     Helen Loraine    2    True         0
2  Hudson Creighton   30   False         0
3         Hudson JC   25    True         0

- Create a series named 'new_row' containing 'Rene Lievens', 24, False, and 0
- Add 'new_row' at the end of "df_scratch"

In [7]:
new_row = pd.Series(["Rene Lievens", 24, False, 0], 
                    index=["Name", "Age", "Female", "Survived"])
df_scratch.append(new_row, ignore_index=True)

               Name  Age  Female  Survived
0  Elizabeth Walton   29    True         1
1     Helen Loraine    2    True         0
2  Hudson Creighton   30   False         0
3         Hudson JC   25    True         0
4      Rene Lievens   24   False         0

### 1.3 Describing the Data

Show the first 3 rows of "titanic"

In [8]:
titanic.head(3)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

Get the number of rows and columns

In [9]:
titanic.shape

(1313, 6)

Get descriptive statistics for numeric columns

In [10]:
titanic.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

### 1.4 Navigating DataFrames

- Select only the 10th row of *titanic*
- Select rows 14-18 all inclusive
- Select the first 3 rows without using *head()*
- Select the last row
- Set index to "Name" and name the new dataframe *titanic_a*
- In *titanic_a*, find "Zenni, Mr Philip"

Select only the 10th row of titanic

In [11]:
titanic.iloc[9]

Name        Artagaveytia, Mr Ramon
PClass                         1st
Age                             71
Sex                           male
Survived                         0
SexCode                          0
Name: 9, dtype: object

Select rows 14-18 all inclusive

In [12]:
titanic.iloc[13:18]

,Name,PClass,Age,Sex,Survived,SexCode
13,"Barkworth, Mr Algernon H",1st,NaN,male,1,0
14,"Baumann, Mr John D",1st,NaN,male,0,0
15,"Baxter, Mrs James (Helene DeLaudeniere Chaput)",1st,50.0,female,1,1
16,"Baxter, Mr Quigg Edmond",1st,24.0,male,0,0
17,"Beattie, Mr Thomson",1st,36.0,male,0,0

Select the first 3 rows without using head()

In [13]:
titanic.iloc[:3]

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

Select the last row

In [14]:
titanic.iloc[-1]

Name        Zimmerman, Leo
PClass                 3rd
Age                     29
Sex                   male
Survived                 0
SexCode                  0
Name: 1312, dtype: object

- Set index to "Name" and name the new dataframe "titanic_a" 
- In "titanic_a", find 'Zenni, Mr Philip'

In [15]:
titanic_a = titanic.set_index(titanic["Name"])
titanic_a.loc["Zenni, Mr Philip"]

Name        Zenni, Mr Philip
PClass                   3rd
Age                       22
Sex                     male
Survived                   0
SexCode                    0
Name: Zenni, Mr Philip, dtype: object

**Note:** To select individual rows and slices of rows, pandas provides two methods:
* `loc` is useful when the index of the DataFrame is a label (a string)
* `iloc` works by looking for the position in the DataFrame. For exmaple, iloc[0] will return the first row regardless of whether the index is an integer or a label.

### 1.5 Selecting Rows on Conditionals

From "titanic", show the first 3 rows where column 'Sex' is 'female'

In [16]:
titanic[titanic['Sex'] == 'female'].head(3)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

Show the last 3 rows where column 'Sex' is 'male'

In [17]:
titanic[titanic['Sex'] == 'male'].tail(3)

                  Name PClass   Age   Sex  Survived  SexCode
1310  Zenni, Mr Philip    3rd  22.0  male         0        0
1311  Lievens, Mr Rene    3rd  24.0  male         0        0
1312    Zimmerman, Leo    3rd  29.0  male         0        0

Select all of the rows where passenger is both female and 63 or older

In [18]:
titanic[(titanic['Sex'] == 'female') & (titanic['Age'] >= 63)]

,Name,PClass,Age,Sex,Survived,SexCode
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
67,"Compton, Mrs Alexander Taylor (Mary Eliza Inge...",1st,64.0,female,1,1
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1
253,"Straus, Mrs Isidor (Ida Blun)",1st,63.0,female,0,1
1264,"Turkula, Mrs Hedvig",3rd,63.0,female,1,1

### 1.6 Replacing Values

Replace "female" with "Woman" in the "Sex" column and show the first 3 rows

In [19]:
titanic["Sex"]. replace("female", "Woman"). head(3)

0    Woman
1    Woman
2     male
Name: Sex, dtype: object

Replace "female" with "Woman" and "male"  with "Man" in the "Sex" column and show the last 3 rows

In [20]:
titanic["Sex"]. replace(["female", "male"], ["Woman", "Man"]).tail(3)

1310    Man
1311    Man
1312    Man
Name: Sex, dtype: object

Replace 1 with "one" and 0 with "zero" and show rows 53-55 all inclusive

In [21]:
titanic.replace([0, 1], ["zero", "one"]).iloc[53:56]

,Name,PClass,Age,Sex,Survived,SexCode
53,"Cavendish, Mr Tyrell William",1st,36,male,zero,zero
54,"Cavendish, Mrs Tyrell William Julia Florence S...",1st,NaN,female,one,one
55,"Chaffee, Mr Herbert Fuller",1st,46,male,zero,zero

Replace "1st" with "First" using regular expressions and show first 3 rows

In [22]:
titanic.replace(r"1st", "First", regex=True).head(3)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1          Allison, Miss Helen Loraine  First   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton  First  30.0    male         0        0

### 1.7 Renaming Columns

Rename the "PClass" column "Pass_Class" and show first 3 rows

In [23]:
titanic.rename(columns={'PClass': 'Pass_Class'}).head(3)

,Name,Pass_Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0

Rename column "Sex" to "Gender and "Survived" to "Survivor" and show first 3 rows

In [24]:
titanic.rename(columns={'Sex': 'Gender', 'Survived': 'Survivor'}).head(3)

                                  Name PClass   Age  Gender  Survivor  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

### 1.8 Finding Basic Statistics

Use the format function to print 
- Maximum, 
- Minimum, 
- Mean, 
- Sum, 
- Standard Error of the Mean, 
- Mode, and 
- Median" for the "Age" column

In [25]:
print('Maximum: {}'.format(titanic['Age'].max()))
print('Minimum: {}'.format(titanic['Age'].min()))
print('Mean: {}'.format(titanic['Age'].mean()))
print('Sum: {}'.format(titanic['Age'].sum()))
print("Standard Error of the Mean: {}".format(titanic['Age'].sem()))
print("Mode: {}".format(titanic['Age'].mode()))
print("Median: {}".format(titanic['Age'].median()))

Maximum: 71.0
Minimum: 0.17
Mean: 30.397989417989415
Sum: 22980.88
Standard Error of the Mean: 0.5185965877244657
Mode: 0    22.0
dtype: float64
Median: 28.0

Use the format function to print 
- Variance, 
- Standard Deviation, 
- Kurtosis, and 
- Skewness for the entire dataframe

In [26]:
print("Variance: {}".format(titanic.var()))
print("Standard Deviation: {}".format(titanic.std()))
print("Kurtosis: {}".format(titanic.kurt()))
print("Skewness: {}".format(titanic.skew()))

Variance: Age         203.320470
Survived      0.225437
SexCode       0.228230
dtype: float64
Standard Deviation: Age         14.259049
Survived     0.474802
SexCode      0.477734
dtype: float64
Kurtosis: Age        -0.036536
Survived   -1.562162
SexCode    -1.616702
dtype: float64
Skewness: Age         0.368511
Survived    0.663491
SexCode     0.621098
dtype: float64

Show the count for the entire dataframe

In [27]:
titanic.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

### 1.9 Finding Unique Values

Show unique values in the "Sex" column

In [28]:
titanic['Sex'].unique()

array(['female', 'male'], dtype=object)

Show value counts in the "Sex" column

In [29]:
titanic['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

Show value counts in the "PClass" column

In [30]:
titanic["PClass"].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

Show the number of unique values in the "PClass" column

In [31]:
titanic["PClass"].nunique()

4

### 1.10 Handling Missing Values

Select missing values in "Age" column and show first 2 rows

In [32]:
titanic[titanic['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

- Import NumPy, 
- Replace "male" in the "Sex" column with "NaN" and show first 3 rows

In [33]:
import numpy as np
titanic["Sex"].replace('male', np.nan).head(3)

0    female
1    female
2       NaN
Name: Sex, dtype: object

### 1.11 Deleting a Column

Drop the "Age" column and show 3 rows

In [34]:
titanic.drop('Age', axis=1).head(3)

                                  Name PClass     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  female         1        1
1          Allison, Miss Helen Loraine    1st  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st    male         0        0

Drop the "Survived" and "SexCode" columns and show 2 rows

In [35]:
titanic.drop(["Survived", "SexCode"], axis=1).head(2)

                           Name PClass   Age     Sex
0  Allen, Miss Elisabeth Walton    1st  29.0  female
1   Allison, Miss Helen Loraine    1st   2.0  female

Show columns in "titanic"

In [36]:
titanic.columns

Index(['Name', 'PClass', 'Age', 'Sex', 'Survived', 'SexCode'], dtype='object')

- Create a new dataframe "titanic_b" that is *titanic* without the second column
- Show the first 3 rows of "titanic_b"

In [37]:
titanic_b = titanic.drop(titanic.columns[1], axis=1)
titanic_b.head(3)

                                  Name   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton  29.0  female         1        1
1          Allison, Miss Helen Loraine   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton  30.0    male         0        0

### 1.12 Deleting a Row

In "titanic", drop the first two rows and show the first 3 rows

In [38]:
titanic.drop([0, 1], axis=0).head(3)

,Name,PClass,Age,Sex,Survived,SexCode
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

Delete all rows where "Sex" is "male"

In [39]:
titanic[titanic['Sex'] != 'male'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

Delete the row where the "Name" is "Allison, Miss Helen Loraine"

In [40]:
titanic[titanic['Name'] != 'Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

Delete the row with index 2

In [41]:
titanic[titanic.index != 2].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

### 1.13 Dropping Duplicate Rows

- Drop duplicates in "titanic" and assign it to a new dataframe named "titanic_c"
- Print the number of rows in "titanic" and "titanic_c" side by side

In [42]:
titanic_c = titanic.drop_duplicates()
print(len(titanic), len(titanic_c))

1313 1313

- Drop duplicates in "Age" column of "titanic" and assign it to a new dataframe "titanic_c"
- Print the number of rows in "titanic" and "titanic_c" side by side

In [43]:
titanic_c = titanic.drop_duplicates(subset=["Age"])
print(len(titanic), len(titanic_c))

1313 76

Show the first two rows of "titanic_c"

In [44]:
titanic_c.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

- Drop duplicates in "Age" column of "titanic", while keeping 'last', and assign it to a new dataframe "titanic_d".
- Show the first two rows of "titanic_d"

In [45]:
titanic_d = titanic.drop_duplicates(subset=["Age"], keep="last")
titanic_d.head(2)

                              Name PClass    Age   Sex  Survived  SexCode
4    Allison, Master Hudson Trevor    1st   0.92  male         1        0
72  Crosby, Captain Edward Gifford    1st  70.00  male         0        0

In "titanic_d", check whether a row is duplicated or not in the "Sex" column and show the first 4 rows

In [46]:
titanic_d["Sex"].duplicated().head(4)

4      False
72      True
73     False
187     True
Name: Sex, dtype: bool

### 1.14 Grouping Rows by Values

In "titanic", group by "Sex" and count the number of people in each category

In [47]:
titanic.groupby('Sex').count()

        Name  PClass  Age  Survived  SexCode
Sex
female   462     462  288       462      462
male     851     851  468       851      851

Group by "Sex" and count the number of "Name" in each category

In [48]:
titanic.groupby('Sex')['Name'].count()

Sex
female    462
male      851
Name: Name, dtype: int64

Group by "Sex, PClass, Survived" and count the number values in each category

In [49]:
titanic.groupby(['Sex', 'PClass', 'Survived']).count()

                        Name  Age  SexCode
Sex    PClass Survived
female 1st    0            9    5        9
              1          134   96      134
       2nd    0           13   10       13
              1           94   75       94
       3rd    0          132   56      132
              1           80   46       80
male   *      0            1    0        1
       1st    0          120   82      120
              1           59   43       59
       2nd    0          147  106      147
              1           25   21       25
       3rd    0          441  184      441
              1           58   32       58

Group by "Sex, PClass, Survived" and find the mean "Age" in each category

In [50]:
titanic.groupby(['Sex', 'PClass', 'Survived'])['Age'].mean()

Sex     PClass  Survived
female  1st     0           35.200000
                1           37.906250
        2nd     0           31.400000
                1           26.853333
        3rd     0           22.821429
                1           22.721087
male    *       0                 NaN
        1st     0           44.841463
                1           34.253953
        2nd     0           31.698113
                1           14.839524
        3rd     0           27.099620
                1           22.088437
Name: Age, dtype: float64

### 1.15 Grouping Rows by Time

Our *titanic* dataset has no datetime column so let's create a new dataframe for practice purposes only. We need Pandas and NumPy libraries for this, which are already loaded:

Create a date range (named *time_index*) starting from 06/06/2017 with 100,000 periods that are 30 seconds apart from each other

In [51]:
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

Create a dataframe named *time_df* and set its index to *time_index*. Show the first 3 rows

In [52]:
time_df = pd.DataFrame(index=time_index)
time_df.head(3)

Empty DataFrame
Columns: []
Index: [2017-06-06 00:00:00, 2017-06-06 00:00:30, 2017-06-06 00:01:00]

Create a new column "Sales_Amount" containing 100,000 random integers between 1 and 10. Show first 3 rows

In [53]:
time_df['Sales_Amount'] = np.random.randint(1, 10, 100000)
time_df.head(3)

                     Sales_Amount
2017-06-06 00:00:00             3
2017-06-06 00:00:30             7
2017-06-06 00:01:00             5

Group rows by week and calculate the sum per week

In [54]:
time_df.resample('W').sum()

            Sales_Amount
2017-06-11         86708
2017-06-18        101526
2017-06-25        100340
2017-07-02        101014
2017-07-09        100847
2017-07-16         10358

Group rows by 3 weeks and calculate the mean per week

In [55]:
time_df.resample('3W').mean()

            Sales_Amount
2017-06-11      5.017824
2017-07-02      5.007937
2017-07-23      5.000225

Group rows by month and show the number of sales per month

In [56]:
time_df.resample('M').count()

            Sales_Amount
2017-06-30         72000
2017-07-31         28000

Group rows by month and show the number of sales per month but label dates on left

In [57]:
time_df.resample('M', label='left').count()

            Sales_Amount
2017-05-31         72000
2017-06-30         28000

### 1.16 Looping Over a Column

Back to our *titanic* dataframe: Show the first 3 rows of "Name" column only

In [58]:
titanic['Name'][:3]

0           Allen, Miss Elisabeth Walton
1            Allison, Miss Helen Loraine
2    Allison, Mr Hudson Joshua Creighton
Name: Name, dtype: object

Use *for...loop* to print the 3 names in uppercase

In [59]:
for name in titanic['Name'][:3]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE
ALLISON, MR HUDSON JOSHUA CREIGHTON

Use list comprehension to print the 3 names in uppercase

In [60]:
[name.upper() for name in titanic['Name'][:3]]

['ALLEN, MISS ELISABETH WALTON',
 'ALLISON, MISS HELEN LORAINE',
 'ALLISON, MR HUDSON JOSHUA CREIGHTON']

### 1.17 Applying a Function to Columns and Groups

Create a function "uppercase" that takes in one argument x and return x in uppercase. Try it on the string 'test'

In [61]:
def uppercase(x):
    return x.upper()
uppercase("test")

'TEST'

Apply the "uppercase" function on the entire "Name" column and show the first 4 rows

In [62]:
titanic['Name'].apply(uppercase).head(4)

0                     ALLEN, MISS ELISABETH WALTON
1                      ALLISON, MISS HELEN LORAINE
2              ALLISON, MR HUDSON JOSHUA CREIGHTON
3    ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
Name: Name, dtype: object

Group rows by "Sex", then "PClass", and "Survived" and a apply a lambda function to count on "Name" column

In [63]:
titanic.groupby(['Sex', 'PClass', 'Survived'])['Name'].apply(lambda x: x.count())

Sex     PClass  Survived
female  1st     0             9
                1           134
        2nd     0            13
                1            94
        3rd     0           132
                1            80
male    *       0             1
        1st     0           120
                1            59
        2nd     0           147
                1            25
        3rd     0           441
                1            58
Name: Name, dtype: int64

### 1.18 Concatenating DataFrames

- Create a dictionary "dict_a" with the following keys and corresponding values:
    1. key is 'id', values are '1', '2', '3'
    2. key is 'first', values are 'Alex', 'Amy', 'Allen'
    3. key is 'last', values are 'Anderson', 'Ackerman', 'Ali'
- Create a list "cols" whose values are the keys to "dict_a"
- Create a new dataframe "df_a" whose values are contents of "dict_a" and columns are contents of "cols"
- Show "df_a"

In [64]:
dict_a = {'id': ['1', '2', '3'],
          'first': ['Alex', 'Amy', 'Allen'],
          'last': ['Anderson', 'Ackerman', 'Ali']}
cols = ['id', 'first', 'last']
df_a = pd.DataFrame(dict_a, columns=cols)
df_a

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali

- Create a dictionary "dict_b" with the following keys and corresponding values:
    1. key is 'id', values are '4', '5', '6',
    2. key is 'first', values are 'Billy', 'Brian', 'Bran',
    3. key is 'last', values are 'Bonder', 'Black', 'Balwner'
- Create a new dataframe "df_b" whose values are contents of "dict_b" and columns are contents of "cols"
- Show "df_b"

In [65]:
dict_b = {'id': ['4', '5', '6'],
          'first': ['Billy', 'Brian', 'Bran'],
          'last': ['Bonder', 'Black', 'Balwner']}
df_b = pd.DataFrame(dict_b, columns=cols)
df_b

  id  first     last
0  4  Billy   Bonder
1  5  Brian    Black
2  6   Bran  Balwner

Concatenate "df_a" and "df_b" by rows

In [66]:
pd.concat([df_a, df_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

Concatenate "df_a" and "df_b" by rows but ignore index

In [67]:
pd.concat([df_a, df_b], axis=0, ignore_index=True)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
3  4  Billy    Bonder
4  5  Brian     Black
5  6   Bran   Balwner

Concatenate "df_a" and "df_b" by columns

In [68]:
pd.concat([df_a, df_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

Concatenate "df_a" and "df_b" by columns but ignore index

In [69]:
pd.concat([df_a, df_b], axis=1, ignore_index=True)

   0      1         2  3      4        5
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

- Create a series named "row_a" containing *10, "Chris", "Chillon"* whose index is the contents of "cols"
- Append "row_a" to "df_a" and ignore index

In [70]:
row_a = pd.Series([10, "Chris", "Chillon"], index=cols)
df_a.append(row_a, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

### 1.19 Merging DataFrames

- Create a dictionary "dict_c" with the following keys and corresponding values:
    1. key is 'employee_id', values are '1', '2', '3', '4'
    2. key is 'name', values are 'Amy Jones', 'Allen Keys', 'Alice Bees','Tim Horton'
- Create a new dataframe "df_c" whose values are contents of "dict_c" and columns are 'employee_id' and 'name'
- Show "df_c"

In [71]:
dict_c = {'employee_id': ['1', '2', '3', '4'],
          'name': ['Amy Jones', 'Allen Keys', 'Alice Bees','Tim Horton']}
df_c = pd.DataFrame(dict_c, columns = ['employee_id', 'name'])
df_c

  employee_id        name
0           1   Amy Jones
1           2  Allen Keys
2           3  Alice Bees
3           4  Tim Horton

- Create a dictionary "dict_d" with the following keys and corresponding values:
    1. key is 'employee_id', values are '3', '4', '5', '6',
    2. key is 'total_sales', values are 23456, 2512, 2345, 1455
- Create a new dataframe "df_d" whose values are contents of "dict_d" and columns are 'employee_id' and 'total_sales'
- Show "df_d"

In [72]:
dict_d = {'employee_id': ['3', '4', '5', '6'],
              'total_sales': [23456, 2512, 2345, 1455]}
df_d = pd.DataFrame(dict_d, columns = ['employee_id', 'total_sales'])
df_d

  employee_id  total_sales
0           3        23456
1           4         2512
2           5         2345
3           6         1455

Merge "df_c" with "df_d" on 'employee_id'

In [73]:
pd.merge(df_c, df_d, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

Do an outer merge of "df_c" and "df_d" on 'employee_id'

In [74]:
pd.merge(df_c, df_d, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

Do a left merge of "df_c" and "df_d" on 'employee_id'

In [75]:
pd.merge(df_c, df_d, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

Merge "df_c" with "df_d" left on 'employee_id' and right on 'employee_id'

In [76]:
pd.merge(df_c, df_d, left_on='employee_id', right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

Merge "df_c" with "df_d" with left index and right index true

In [77]:
pd.merge(df_c, df_d, left_index=True, right_index=True)

  employee_id_x        name employee_id_y  total_sales
0             1   Amy Jones             3        23456
1             2  Allen Keys             4         2512
2             3  Alice Bees             5         2345
3             4  Tim Horton             6         1455